USE Hotel;
GO
IF EXISTS (SELECT * FROM sys.tables WHERE NAME = 'Clients')
	DROP TABLE Clients;

create table Clients
	(Client_ID INT IDENTITY(1,1),
	FIO VARCHAR(45) NOT NULL,
	Sex VARCHAR(3) NOT NULL,
	Address VARCHAR(50) NOT NULL,
	Date_birth DATE NOT NULL,
	Psprt_series INT NOT NULL,
	Psprt_number INT NOT NULL,
	Date_to DATE NOT NULL,
	Date_from DATE NOT NULL,

	CONSTRAINT PK_client PRIMARY KEY (Client_ID));
GO

USE Hotel;
GO
SET NOCOUNT ON;
INSERT INTO Clients (FIO, Sex, Address, Date_birth, Psprt_series, Psprt_number, Date_to, Date_from) VALUES
('Овсянникова Анна Максимовна','жен','г. Стерлитамак, Дружная ул., д. 2 кв.70','24-11-1992','4969','769909','01-05-2023','15-05-2023'),
('Зверев Матвей Игоревич','муж','г. Калининград, Пролетарская ул., д. 5 кв.183','18-10-1970','4510','269087','27-04-2023','03-05-2023'),
('Шмелева Варвара Адамовна','жен','г. Омск, Минская ул., д. 21 кв.77','11-08-1990','4511','670896','15-05-2023','17-05-2023'),
('Федоров Максим Степанович','муж','г. Ковров, Почтовая ул., д. 15 кв.34','11-08-1990','4824',' 939726','15-04-2023','29-04-2023'),
('Баранов Семён Артёмович','муж','г. Пятигорск, Центральная ул., д. 12 кв.18','20-12-1962','4145','101229','14-03-2023','14-05-2023'),
('Романов Арсений Глебович','муж','г. Якутск, Спортивная ул., д. 20 кв.178','24-09-1962','4948','729607','23-04-2023','10-05-2023'),
('Пантелеев Адам Макарович','муж','г. Кострома, Пионерская ул., д. 4 кв.153','05-09-1969','4765','586769','30-04-2023','14-05-2023'),
('Румянцева Кристина Макаровна','жен','г. Кемерово, Лесной пер., д. 18 кв.19','08-10-1995','4720','532718','28-04-2023','30-04-2023'),
('Климова Елизавета Александровна','жен','г. Новосибирск, Сосновая ул., д. 22 кв.93','10-05-1964','4155','807888','10-03-2023','30-03-2023'),
('Свешникова Людмила Михайловна','жен','г. Сочи, Мирная ул., д. 18 кв.143','16-10-1980','4226','153735','10-05-2023','14-05-2023');
GO